Revit 2027 API
ElectricalSetting.IsValidSpecificFittingAngle Method
 Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidSpecificFittingAngle(
	double angle
)
Public Function IsValidSpecificFittingAngle (
	angle As Double
) As Boolean
public:
bool IsValidSpecificFittingAngle(
	double angle
)
member IsValidSpecificFittingAngle :
        angle : float -> bool
Parameters
angle Double
 The angle value (in degree).
Return Value
Boolean
 True if the given value is a valid specific fitting angle.
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace